//Для каждой группы указываются предметы которые должны быть у них в расписании
//Для каждого учителя указывается предметы которые он может вести
//Для каждого предмета указывается кабинеты в котором эти предметы могут быть проведены
//
//1) Указывается список учителей, предметов, учебные группы, кабинеты,  которые можно указать при составлении
//   расписания(опционально, дефолтно выбраны все возможные предметы)
//2) Для каждого предмета указываются преподаватели, и кабинеты если они ранее не были указаны (могут быть указаны при составлении базы данных)
//   Для каждой группы указываются предметы и часы
//4) Таблица, где строки это дни недели, а столбцы это группы
//   Слева от таблицы будет список предметов. При расширении конкретного предмета будет указано сколько нужно еще распределить часов для каждой группы
//   При клике на столбец (группу) останутся только нужные группе предметы
//   При клике на день недели будет возможность выбрать предмет
//   Будет кнопка с помощью которых можно будет создать "потоковый" предмет для одновременно несколькх групп
//   Процесс должен сохраняться что бы если что можно было вернуться
//
//  Привязать учителей к предметам
//  Привязать предметы к кабинетам
//  Привязать возможное время к учителям
//  Привязать возможные дни недели к учителям

//  Указывается максимальное кол-во групп в одном кабинете
//  Указывается максимальное кол-во групп которые могут быть на предмете одновременно
//  Мак  кол-во определенных предметов в неделю
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//